In [2]:
import pandas as pd


num = pd.Series([1,2,3,4,5,6])
print(num)

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [3]:
num = pd.Series([1,2,3,4,5,6,7] , index=["a" , "b" , "c" , "d","e","f","g"])

num
print(num[2])
print(num[:7])
print(num["b"])

3
a    1
b    2
c    3
d    4
e    5
f    6
g    7
dtype: int64
2

/tmp/ipython-input-2924277500.py:4: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(num[2])

In [4]:
data = {
    "Name":       ["Ravi", "Priya", "Arjun", "Sneha", "Kumar"],
    "Age":        [28, 32, 25, 29, 35],
    "Salary":     [45000, 75000, 50000, 80000, 60000],
    "Department": ["HR", "Tech", "Finance", "Tech", "HR"]
}

df = pd.DataFrame(data)

# for i in df["name"]:
#     print(i)
print(df)
print("_" * 45)
# print(df.head())
print(df.head(2))
print("_" * 45)
print(df.tail(2),"\n")
print(df.shape)

    Name  Age  Salary Department
0   Ravi   28   45000         HR
1  Priya   32   75000       Tech
2  Arjun   25   50000    Finance
3  Sneha   29   80000       Tech
4  Kumar   35   60000         HR
_____________________________________________
    Name  Age  Salary Department
0   Ravi   28   45000         HR
1  Priya   32   75000       Tech
_____________________________________________
    Name  Age  Salary Department
3  Sneha   29   80000       Tech
4  Kumar   35   60000         HR

(5, 4)

In [5]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        5 non-null      object
 1   Age         5 non-null      int64
 2   Salary      5 non-null      int64
 3   Department  5 non-null      object
dtypes: int64(2), object(2)
memory usage: 292.0+ bytes
None

In [6]:
df.describe()

             Age        Salary
count   5.000000      5.000000
mean   29.800000  62000.000000
std     3.834058  15247.950682
min    25.000000  45000.000000
25%    28.000000  50000.000000
50%    29.000000  60000.000000
75%    32.000000  75000.000000
max    35.000000  80000.000000

In [7]:
df

    Name  Age  Salary Department
0   Ravi   28   45000         HR
1  Priya   32   75000       Tech
2  Arjun   25   50000    Finance
3  Sneha   29   80000       Tech
4  Kumar   35   60000         HR

In [10]:
high_earners = df[df["Salary"]>60000]

emp = df[df["Department"] == "Tech"]


result = df[(df["Salary"] > 50000) & (df["Department"] == "Tech")]


# Adding new column
df["New Salary"] = df["Salary"] * 1.10


df.columns
print(high_earners)
print(emp)
print(result)
# print(df)

    Name  Age  Salary Department  New Salary
1  Priya   32   75000       Tech     82500.0
3  Sneha   29   80000       Tech     88000.0
    Name  Age  Salary Department  New Salary
1  Priya   32   75000       Tech     82500.0
3  Sneha   29   80000       Tech     88000.0
    Name  Age  Salary Department  New Salary
1  Priya   32   75000       Tech     82500.0
3  Sneha   29   80000       Tech     88000.0

# Small Assignment of first Phase

In [8]:
# A company has 7 employees:

# Name:       ["Arun", "Bhanu", "Chitra", "Deepak",
#              "Esha", "Farhan", "Geetha"]
# Age:        [24, 35, 28, 42, 30, 26, 38]
# Salary:     [30000, 85000, 52000, 95000, 61000, 40000, 78000]
# Department: ["HR", "Tech", "Finance", "Tech",
#              "HR", "Finance", "Tech"]
# Experience: [1, 8, 4, 15, 6, 2, 10]

# Tasks:
# 1. Create a DataFrame with this data
# 2. Print first 4 rows using .head()
# 3. Check shape, info, and describe
# 4. Select only the Name and Salary columns
# 5. Filter employees whose salary is above 60000
# 6. Filter employees who are in the Tech department
# 7. Add a new column "Bonus" = 10% of salary for everyone
# 8. Find the average salary using the DataFrame column

In [65]:
import pandas as pd
# import numpy as np

data = {
    "Name" :      ["Arun", "Bhanu", "Chitra", "Deepak", "Esha", "Farhan", "Geetha"],
    "Age" :       [24, 35, 28, 42, 30, 26, 38],
    "Salary":     [30000, 85000, 52000, 95000, 61000, 40000, 78000],
    "Department": ["HR", "Tech", "Finance", "Tech", "HR", "Finance", "Tech"],
    "Experience": [1, 8, 4, 15, 6, 2, 10]
}


df = pd.DataFrame(data)

# Tasks:
# 1. Create a DataFrame with this data
print(df)
print("_"*45)
# 2. Print first 4 rows using .head()
first_4_rows = df.head(4)
print(first_4_rows)

# 3. Check shape, info, and describe
# print(df.shape)
# print("_"*45)
# df.describe()
# print("_"*45)
# df.info()

# 4. Select only the Name and Salary columns
name_col = df[["Name","Salary"]]
print(name_col)
print("_"*45)

# 5. Filter employees whose salary is above 60000
filter_sal = df[df["Salary"] > 60000]
print(filter_sal)
print("_"*45)

# 6. Filter employees who are in the Tech department
filter_tech = df[df["Department"] == "Tech"]
print(filter_tech)
print("_"*45)

# 7. Add a new column "Bonus" = 10% of salary for everyone
df["Bonus Salary"] = df["Salary"] * 1.10
print(df)

# 8. Find the average salary using the DataFrame column
avg_salary = df["Salary"].mean()
print(avg_salary)

     Name  Age  Salary Department  Experience
0    Arun   24   30000         HR           1
1   Bhanu   35   85000       Tech           8
2  Chitra   28   52000    Finance           4
3  Deepak   42   95000       Tech          15
4    Esha   30   61000         HR           6
5  Farhan   26   40000    Finance           2
6  Geetha   38   78000       Tech          10
_____________________________________________
     Name  Age  Salary Department  Experience
0    Arun   24   30000         HR           1
1   Bhanu   35   85000       Tech           8
2  Chitra   28   52000    Finance           4
3  Deepak   42   95000       Tech          15
     Name  Salary
0    Arun   30000
1   Bhanu   85000
2  Chitra   52000
3  Deepak   95000
4    Esha   61000
5  Farhan   40000
6  Geetha   78000
_____________________________________________
     Name  Age  Salary Department  Experience
1   Bhanu   35   85000       Tech           8
3  Deepak   42   95000       Tech          15
4    Esha   30   61000         HR           6
6  Geetha   38   78000       Tech          10
_____________________________________________
     Name  Age  Salary Department  Experience
1   Bhanu   35   85000       Tech           8
3  Deepak   42   95000       Tech          15
6  Geetha   38   78000       Tech          10
_____________________________________________
     Name  Age  Salary Department  Experience  Bonus Salary
0    Arun   24   30000         HR           1       33000.0
1   Bhanu   35   85000       Tech           8       93500.0
2  Chitra   28   52000    Finance           4       57200.0
3  Deepak   42   95000       Tech          15      104500.0
4    Esha   30   61000         HR           6       67100.0
5  Farhan   26   40000    Finance           2       44000.0
6  Geetha   38   78000       Tech          10       85800.0
63000.0

In [8]:
# Print first 2 rows
# Print shape
# Print column names
# Find average salary
# Add a column "Bonus" = Salary * 0.1

In [74]:
data = {
    "Name" : ["A","B","C","D"],
    "Age"  : [25,28,22,30],
    "Salary" :[30000,40000,25000,50000]
}

df = pd.DataFrame(data)
print(df)

print(df.head(2))

df.shape
print(df["Name"])
print(df["Salary"].mean())

df["Bonus"] = df["Salary"] * 0.1
df

  Name  Age  Salary
0    A   25   30000
1    B   28   40000
2    C   22   25000
3    D   30   50000
  Name  Age  Salary
0    A   25   30000
1    B   28   40000
0    A
1    B
2    C
3    D
Name: Name, dtype: object
36250.0

  Name  Age  Salary   Bonus
0    A   25   30000  3000.0
1    B   28   40000  4000.0
2    C   22   25000  2500.0
3    D   30   50000  5000.0

In [96]:
import numpy as np

data2 = {
    "Name":       ["Ravi", "Priya", "Arjun", "Sneha", "Kumar", "Divya"],
    "Age":        [28, 32, None, 29, 35, 27],
    "Salary":     [45000, None, 50000, 80000, None, 60000],
    "Department": ["HR", "Tech", None, "Tech", "HR", "Finance"]
}
df2 = pd.DataFrame(data2)
print(df2)

print(df2.isnull())
print(df2.isnull().sum())

df_dropped = df2.dropna()
print(df_dropped)


# fillna()
filling_age = df2["Age"].mean()
df2["Age"] = df2["Age"].fillna(filling_age)

filling_salary = df2["Salary"].median()
df2["Salary"] = df2["Salary"].fillna(filling_salary)


df2["Department"] = df2["Department"].fillna(df2["Department"].mode()[0])

print(df2)
print(df2.isnull().sum())


# Grouby operation
grouping = df2.groupby("Department")["Salary"].mean()
print(grouping)

print(df2.groupby("Department")["Salary"].sum())
print(df2.groupby("Department")["Salary"].count())
print(df2.groupby("Department")["Salary"].max())
print("_"*50)
print(df2.groupby("Department")["Salary"].agg(["mean" , "max" , "count" ,"sum"]))
print(df2.groupby("Department")[["Salary", "Age"]].mean())

    Name   Age   Salary Department
0   Ravi  28.0  45000.0         HR
1  Priya  32.0      NaN       Tech
2  Arjun   NaN  50000.0       None
3  Sneha  29.0  80000.0       Tech
4  Kumar  35.0      NaN         HR
5  Divya  27.0  60000.0    Finance
    Name    Age  Salary  Department
0  False  False   False       False
1  False  False    True       False
2  False   True   False        True
3  False  False   False       False
4  False  False    True       False
5  False  False   False       False
Name          0
Age           1
Salary        2
Department    1
dtype: int64
    Name   Age   Salary Department
0   Ravi  28.0  45000.0         HR
3  Sneha  29.0  80000.0       Tech
5  Divya  27.0  60000.0    Finance
    Name   Age   Salary Department
0   Ravi  28.0  45000.0         HR
1  Priya  32.0  55000.0       Tech
2  Arjun  30.2  50000.0         HR
3  Sneha  29.0  80000.0       Tech
4  Kumar  35.0  55000.0         HR
5  Divya  27.0  60000.0    Finance
Name          0
Age           0
Salary        0
Department    0
dtype: int64
Department
Finance    60000.0
HR         50000.0
Tech       67500.0
Name: Salary, dtype: float64
Department
Finance     60000.0
HR         150000.0
Tech       135000.0
Name: Salary, dtype: float64
Department
Finance    1
HR         3
Tech       2
Name: Salary, dtype: int64
Department
Finance    60000.0
HR         55000.0
Tech       80000.0
Name: Salary, dtype: float64
__________________________________________________
               mean      max  count       sum
Department
Finance     60000.0  60000.0      1   60000.0
HR          50000.0  55000.0      3  150000.0
Tech        67500.0  80000.0      2  135000.0
             Salary        Age
Department
Finance     60000.0  27.000000
HR          50000.0  31.066667
Tech        67500.0  30.500000

# MINI TASK - REAL WORLD

In [2]:
import pandas as pd

data3 = {
    "Name":       ["Arun", "Bhanu", "Chitra", "Deepak", 
                   "Esha", "Farhan", "Geetha", "Hari"],
    "Age":        [24, 35, 28, 42, 30, 26, 38, None],
    "Salary":     [30000, 85000, None, 95000, 61000, 40000, 78000, 72000],
    "Department": ["HR", "Tech", "Finance", "Tech", 
                   "HR", "Finance", "Tech", None],
    "Experience": [1, 8, 4, 15, 6, 2, 10, 7]
}

# Tasks:
# 1. Create the DataFrame
df3 = pd.DataFrame(data3)
print(df3)
print("_"*50)

# 2. Check how many missing values exist in each column
print(df3.isnull().sum())
print("_"*50)

# 3. Fill missing Age with median age
filling_age_median = df3['Age'].median()
df3["Age"] = df3["Age"].fillna(filling_age_median)


# 4. Fill missing Salary with mean salary
filling_salary_mean = df3["Salary"].mean()
df3["Salary"] = df3["Salary"].fillna(filling_salary_mean).round(2)



# 5. Fill missing Department with mode
df3["Department"] = df3["Department"].fillna(df3["Department"].mode()[0])
print(df3)
print("_"*50)

# 6. Verify no missing values remain
print(df3.isnull().sum())
print("_"*50)

# 7. Use iloc to select first 3 rows and first 3 columns
sorting_rows_cols = df3.iloc[:3 , :3]
print(sorting_rows_cols)
print("_"*50)
# 8. Use loc to filter employees with Experience > 5,
#    showing only Name, Department, Salary columns
filter_emp = df3.loc[df3["Experience"]>5,["Name" , "Department","Salary"]]
print(filter_emp)
print("_"*50)

# 9. Find average salary per department using groupby
avg_sal = df3.groupby("Department")["Salary"].mean()
print(avg_sal)
print("_"*50)

# 10. Find total experience per department using groupby
total_exp = df3.groupby("Department")["Experience"].sum()
print(total_exp)

     Name   Age   Salary Department  Experience
0    Arun  24.0  30000.0         HR           1
1   Bhanu  35.0  85000.0       Tech           8
2  Chitra  28.0      NaN    Finance           4
3  Deepak  42.0  95000.0       Tech          15
4    Esha  30.0  61000.0         HR           6
5  Farhan  26.0  40000.0    Finance           2
6  Geetha  38.0  78000.0       Tech          10
7    Hari   NaN  72000.0       None           7
__________________________________________________
Name          0
Age           1
Salary        1
Department    1
Experience    0
dtype: int64
__________________________________________________
     Name   Age    Salary Department  Experience
0    Arun  24.0  30000.00         HR           1
1   Bhanu  35.0  85000.00       Tech           8
2  Chitra  28.0  65857.14    Finance           4
3  Deepak  42.0  95000.00       Tech          15
4    Esha  30.0  61000.00         HR           6
5  Farhan  26.0  40000.00    Finance           2
6  Geetha  38.0  78000.00       Tech          10
7    Hari  30.0  72000.00       Tech           7
__________________________________________________
Name          0
Age           0
Salary        0
Department    0
Experience    0
dtype: int64
__________________________________________________
     Name   Age    Salary
0    Arun  24.0  30000.00
1   Bhanu  35.0  85000.00
2  Chitra  28.0  65857.14
__________________________________________________
     Name Department   Salary
1   Bhanu       Tech  85000.0
3  Deepak       Tech  95000.0
4    Esha         HR  61000.0
6  Geetha       Tech  78000.0
7    Hari       Tech  72000.0
__________________________________________________
Department
Finance    52928.57
HR         45500.00
Tech       82500.00
Name: Salary, dtype: float64
__________________________________________________
Department
Finance     6
HR          7
Tech       40
Name: Experience, dtype: int64

# ChatGPT Task - Small Problem

In [ ]:

data4 = {
    "Name": ["A", "B", "C", "D", "E"],
    "Age": [25, 28, 22, 30, 26],
    "Salary": [30000, 40000, 25000, 50000, 35000],
    "Department": ["HR", "IT", "Finance", "IT", "HR"]
}

df4 = pd.DataFrame(data4)

# 1 Show employees with Salary > 30000
emp_sal = df4.loc[df4["Salary"] > 30000]
print(emp_sal)
print("_"*50)

# 2 Show employees in IT department
emp_IT_dep = df4.loc[df4["Department"] == "IT"]
print(emp_IT_dep)
print("_"*50)

# 3 Show employees with Age < 28
emp_age = df4.loc[df4["Age"] < 28]
print(emp_age)
print("_"*50)


# 4 Show only Name and Salary columns
name_sal_cols = df4[["Name" , "Salary"]]
print(name_sal_cols)
print("_"*50)

# 5 Show first 3 rows using iloc
first_3_rows = df4.iloc[:3]
print(first_3_rows)
print("_"*50)

# 6 Show Salary of employee at index 3 using loc
sal_ind_3 = df4.loc[3,"Salary"]
print(sal_ind_3)

# 1 Show employees with Salary > 30000 AND Age < 30
print(df4.loc[(df4["Salary"]>30000) & (df4["Age"]<30),["Name"]])

# 2 Show employees NOT in HR department
print(df4.loc[~df4["Department"].isin(["HR"]) ])

# 3 Sort DataFrame by Salary descending
sorting_sal  = df4.sort_values(by="Salary" , ascending=False)
print(sorting_sal)

# 4 Add new column "Tax" = 5% of Salary
df4["Tax"] = df4["Salary"] * 1.05
print(df4)

# 5 Show top 2 highest paid employees
print(sorting_sal.iloc[:2])

# TASK - 1 REAL-WORLD DATA HANDLING USING DATAFRAMES (PANDAS)

In [1]:
import pandas as pd

data5 = {
    "Patient_ID":  [1001, 1002, 1003, 1004, 1005, 1006, 1007, 1008, 1009, 1010],
    "Name":        ["Ravi", "Priya", "Arjun", "Sneha", "Kumar", 
                    "Divya", "Kiran", "Meena", "Suresh", "Anita"],
    "Age":         [45, 32, None, 60, 28, 52, None, 38, 47, 55],
    "Department":  ["Cardiology", "Orthopedic", "Cardiology", "Neurology", 
                    "Orthopedic", "Cardiology", None, "Neurology", 
                    "Orthopedic", None],
    "Bill_Amount": [25000, 15000, 30000, None, 12000, 
                    28000, 22000, None, 18000, 35000],
    "Days_Admitted": [5, 3, 7, 10, 2, 6, 4, 8, 3, 9],
    "Recovered":   ["Yes", "Yes", "No", "Yes", "Yes", 
                    "No", "Yes", "No", "Yes", None]
}


##  Tasks
# ```
# SECTION A  Data Exploration
# 1. Create the DataFrame and print it
df5 = pd.DataFrame(data5)
print(df5)
print("_"*50)
# 2. Check shape  how many patients and columns
# df5.shape           #Checked

# # 3. Run .info() and .describe()
# df5.info()          #Checked
# df5.describe()      #Checked

# 4. Find how many missing values are in each column
print("Before Cleaning Data:-\n",df5.isnull().sum())
print("_"*50)

# ------------------------------------------------------------------------
# SECTION B  Data Cleaning
# 5. Fill missing Age with median age
filling_age = df5["Age"].median()
df5["Age"] = df5["Age"].fillna(filling_age)

# 6. Fill missing Bill_Amount with mean bill amount (round to 2 decimals)
filling_bill = df5["Bill_Amount"].mean()
df5["Bill_Amount"] = df5["Bill_Amount"].fillna(filling_bill).round(2)

# 7. Fill missing Department with mode
df5["Department"] = df5["Department"].fillna(df5["Department"].mode()[0])

# 8. Fill missing Recovered with mode
df5["Recovered"] = df5["Recovered"].fillna(df5["Recovered"].mode()[0])
df5

# 9. Verify zero missing values remain
checking_missing_val = df5.isnull().sum()
print("Before Cleaning Data:-\n",checking_missing_val)
print("_"*50)

# --------------------------------------------------------------------------
# SECTION C  Selecting and Filtering
# 10. Use iloc to select rows 3 to 7 and first 4 columns
select_rows_3_7 = df5.iloc[3:8 , :4]
print(select_rows_3_7)
print("_"*50)

# 11. Use loc to get Name, Department, Bill_Amount 
#     of patients admitted more than 5 days
name_dep_bill_pat = df5.loc[df5["Days_Admitted"] > 5, ["Name" , "Department", "Bill_Amount"]]
print(name_dep_bill_pat)
print("_"*50)

# 12. Filter patients who are in Cardiology department
dep_cardio_pat = df5.loc[df5["Department"] == "Cardiology"]
print(dep_cardio_pat)
print("_"*50)

# 13. Filter patients whose Bill_Amount is above 20000 
#     AND who have Recovered = "Yes"
patient_bill = df5.loc[(df5["Bill_Amount"] > 20000) & (df5["Recovered"] == "Yes")]
print(patient_bill)
print("_"*50)

# --------------------------------------------------------------------------
# SECTION D  Analysis with groupby
# 14. Find average Bill_Amount per Department
avg_bill_amount = df5.groupby("Department")["Bill_Amount"].mean()
print(avg_bill_amount)
print("_"*50)

# 15. Find total Days_Admitted per Department
total_days_dep = df5.groupby("Department")["Days_Admitted"].sum()
print(total_days_dep)
print("_"*50)

# 16. Find count of patients per Department
pat_count_dep = df5.groupby("Department")["Patient_ID"].count()
print(pat_count_dep)
print("_"*50)

# 17. Find max Bill_Amount per Department
max_bill_dep = df5.groupby("Department")["Bill_Amount"].max()
print(max_bill_dep)
print("_"*50)

# 18. Get mean, max, min of Bill_Amount 
#     per Department in ONE line using .agg()
agg_dep = df5.groupby("Department")["Bill_Amount"].agg(["mean", "max","min"])
print(agg_dep)
print("_"*50)
# --------------------------------------------------------------------------
# SECTION E  Think Like a Data Scientist
# 19. Add a new column "Bill_Per_Day" = Bill_Amount / Days_Admitted
#     (this tells cost per day for each patient)
df5["Bill_Per_Day"] = df5["Bill_Amount"] / df5["Days_Admitted"]
df5
print("_"*50)

# 20. Find which Department has the highest average Bill_Per_Day
#     Hint: groupby + mean on the new column
dep_high_billperday = df5.groupby("Department")["Bill_Per_Day"].mean().idxmax()
print(dep_high_billperday)

   Patient_ID    Name   Age  Department  Bill_Amount  Days_Admitted Recovered
0        1001    Ravi  45.0  Cardiology      25000.0              5       Yes
1        1002   Priya  32.0  Orthopedic      15000.0              3       Yes
2        1003   Arjun   NaN  Cardiology      30000.0              7        No
3        1004   Sneha  60.0   Neurology          NaN             10       Yes
4        1005   Kumar  28.0  Orthopedic      12000.0              2       Yes
5        1006   Divya  52.0  Cardiology      28000.0              6        No
6        1007   Kiran   NaN        None      22000.0              4       Yes
7        1008   Meena  38.0   Neurology          NaN              8        No
8        1009  Suresh  47.0  Orthopedic      18000.0              3       Yes
9        1010   Anita  55.0        None      35000.0              9      None
__________________________________________________
Before Cleaning Data:-
 Patient_ID       0
Name             0
Age              2
Department       2
Bill_Amount      2
Days_Admitted    0
Recovered        1
dtype: int64
__________________________________________________
Before Cleaning Data:-
 Patient_ID       0
Name             0
Age              0
Department       0
Bill_Amount      0
Days_Admitted    0
Recovered        0
dtype: int64
__________________________________________________
   Patient_ID   Name   Age  Department
3        1004  Sneha  60.0   Neurology
4        1005  Kumar  28.0  Orthopedic
5        1006  Divya  52.0  Cardiology
6        1007  Kiran  46.0  Cardiology
7        1008  Meena  38.0   Neurology
__________________________________________________
    Name  Department  Bill_Amount
2  Arjun  Cardiology      30000.0
3  Sneha   Neurology      23125.0
5  Divya  Cardiology      28000.0
7  Meena   Neurology      23125.0
9  Anita  Cardiology      35000.0
__________________________________________________
   Patient_ID   Name   Age  Department  Bill_Amount  Days_Admitted Recovered
0        1001   Ravi  45.0  Cardiology      25000.0              5       Yes
2        1003  Arjun  46.0  Cardiology      30000.0              7        No
5        1006  Divya  52.0  Cardiology      28000.0              6        No
6        1007  Kiran  46.0  Cardiology      22000.0              4       Yes
9        1010  Anita  55.0  Cardiology      35000.0              9       Yes
__________________________________________________
   Patient_ID   Name   Age  Department  Bill_Amount  Days_Admitted Recovered
0        1001   Ravi  45.0  Cardiology      25000.0              5       Yes
3        1004  Sneha  60.0   Neurology      23125.0             10       Yes
6        1007  Kiran  46.0  Cardiology      22000.0              4       Yes
9        1010  Anita  55.0  Cardiology      35000.0              9       Yes
__________________________________________________
Department
Cardiology    28000.0
Neurology     23125.0
Orthopedic    15000.0
Name: Bill_Amount, dtype: float64
__________________________________________________
Department
Cardiology    31
Neurology     18
Orthopedic     8
Name: Days_Admitted, dtype: int64
__________________________________________________
Department
Cardiology    5
Neurology     2
Orthopedic    3
Name: Patient_ID, dtype: int64
__________________________________________________
Department
Cardiology    35000.0
Neurology     23125.0
Orthopedic    18000.0
Name: Bill_Amount, dtype: float64
__________________________________________________
               mean      max      min
Department
Cardiology  28000.0  35000.0  22000.0
Neurology   23125.0  23125.0  23125.0
Orthopedic  15000.0  18000.0  12000.0
__________________________________________________
__________________________________________________
Orthopedic

# TASK-2 BIG-REAL-WORLD PROBLEM SOLVING__PANDAS (SCHOOL DATA)

In [ ]:
import pandas as pd
import numpy as np

data6 = {
    "Student_ID":  [201, 202, 203, 204, 205, 206, 207, 208, 209, 210, 211, 212],
    "Name":        ["Aarav", "Bhavya", "Charan", "Divya", "Eshan", "Farida",
                    "Ganesh", "Hema", "Ishan", "Jaya", "Karthik", "Lavanya"],
    "Gender":      ["Male", "Female", "Male", "Female", "Male", "Female",
                    "Male", "Female", "Male", "Female", None, "Female"],
    "Math":        [85, 92, 78, None, 65, 88, 72, 95, None, 80, 70, 90],
    "Science":     [78, 88, None, 82, 70, 92, 68, 90, 75, None, 65, 85],
    "English":     [90, 85, 80, 88, None, 78, 85, 92, 70, 88, 75, None],
    "Section":     ["A", "B", "A", "B", "A", "B", "A", "B", "A", "B", None, "A"],
    "Attendance":  [95, 88, 72, 91, 65, 98, 80, 100, None, 85, 78, 92]
}


##  Tasks
# SECTION A  Data Exploration
# 1. Create the DataFrame and print it
df6 = pd.DataFrame(data6)
print(df6)
print("_"*50)

# 2. Check shape  how many students and columns
df6.shape

# 3. Run .info() and .describe()
# df6.info()
# df6.describe()

# 4. Find how many missing values in each column
print("Before Data Cleaning:-",df6.isnull().sum())
print("_"*50)
# --------------------------------------------------------------------------
# SECTION B  Data Cleaning
# 5. Fill missing Math with median
fill_math = df6["Math"].median()
df6["Math"] = df6["Math"].fillna(fill_math)

# 6. Fill missing Science with median
fill_science = df6["Science"].median()
df6["Science"] = df6["Science"].fillna(fill_science)

# 7. Fill missing English with median
fill_english = df6["English"].median()
df6["English"] = df6["English"].fillna(fill_english)

# 8. Fill missing Attendance with mean (round to 2 decimals)
fill_attendance = df6["Attendance"].mean().round(2)
df6["Attendance"]= df6["Attendance"].fillna(fill_attendance)

# 9. Fill missing Gender with mode
df6["Gender"] = df6["Gender"].fillna(df6["Gender"].mode()[0])

# 10. Fill missing Section with mode
df6["Section"] = df6["Section"].fillna(df6["Section"].mode()[0])

# 11. Verify zero missing values remain
print("After Data cleaning:-",df6.isnull().sum())
print("_"*50)
# --------------------------------------------------------------------------
# SECTION C  Feature Engineering (Creating New Columns)
# 12. Add "Total_Marks" column = Math + Science + English
df6["Total_Marks"] = df6["Math"]+df6["Science"]+df6["English"] 


# 13. Add "Average_Marks" column = Total_Marks / 3 (round to 2)
df6["Average_Marks"] = df6["Total_Marks"] / 3

# 14. Add "Grade" column using these rules:
#     Average >= 90  "A+"
#     Average >= 80  "A"
#     Average >= 70  "B"
#     Average >= 60  "C"
#     Below 60      "Fail"
#     Hint: nested np.where()  you already know this!
grade_condition = [(df6["Average_Marks"] >=90),
                   (df6["Average_Marks"] >=80),
                   (df6["Average_Marks"] >=70),
                   (df6["Average_Marks"] >=60),
                   ]
grade_choices  = ["A+" , "A", "B","C"]
df6["Grade"]= np.select(grade_condition , grade_choices ,default="Fail")    # Important operation for this kind of methods 

# 15. Add "Status" column:
#     Attendance >= 75  "Regular"
#     Attendance < 75   "Irregular"
df6["Status"] = np.where(df6["Attendance"]>=75 , "Regular" , "Irregular")
df6

# --------------------------------------------------------------------------
# SECTION D  Selecting and Filtering
# 16. Use iloc to select rows 4 to 9 and columns 1 to 5
selecting_rows = df6.iloc[4:10, 1:5]
print(selecting_rows)
print("_"*50)

# 17. Use loc to get Name, Section, Grade, Average_Marks
#     of students who scored Average_Marks above 85
stud_above_stud = df6.loc[df6["Average_Marks"] > 85 , ["Name" , "Section", "Grade","Average_Marks"]]
print(stud_above_stud)
print("_"*50)

# 18. Filter all Female students
fem_stud = df6.loc[df6["Gender"] == "Female"]
print(fem_stud)
print("_"*50)

# 19. Filter students who are Irregular in attendance
irregular_atten = df6.loc[df6["Status"] == "Irregular"]
print(irregular_atten)
print("_"*50)

# 20. Filter students from Section A 
#     whose Average_Marks is above 80
filter_secA = df6.loc[(df6["Section"] == "A") & (df6["Average_Marks"] > 80) ]
print(filter_secA)
print("_"*50)
# 21. Filter students who got Grade "A+" OR "A"
#     Hint: use .isin() function  
#     df[df["column"].isin(["value1","value2"])]
filter_stud_A = df6[df6["Grade"].isin(["A+" , "A"])]
print(filter_stud_A)
print("_"*50)
# --------------------------------------------------------------------------
# SECTION E  Groupby Analysis
# 22. Find average Math, Science, English per Section
#     in ONE line using groupby + .agg("mean") 
#     on multiple columns
find_avg_sub = df6.groupby("Section")[["Math" , "Science" ,"English"]].agg(["mean"]).round(1)
print(find_avg_sub)
print("_"*50)

# 23. Find count of students per Grade
find_count_stud = df6.groupby("Grade")["Student_ID"].count()
print(find_count_stud)
print("_"*50)

# 24. Find average Attendance per Gender
find_avg_attend = df6.groupby("Gender")["Attendance"].mean()
print(find_avg_attend)
print("_"*50)

# 25. Find highest Average_Marks per Section
find_high_marks = df6.groupby("Section")["Average_Marks"].max()
print(find_high_marks)
print("_"*50)

# --------------------------------------------------------------------------
# SECTION F  Think Like a Data Scientist
# 26. Find the name of the student with 
#     the highest Total_Marks
#     Hint: idxmax() + iloc or loc
find_high_total = df6.loc[df6["Total_Marks"].idxmax()]
print(find_high_total)
print("_"*50)

# 27. Find how many students passed (Grade != "Fail")
find_pass_stud = np.sum(df6["Grade"] != "Fail")
print(find_pass_stud)
print("_"*50)

# 28. Find what percentage of students are Irregular
#     Formula: (count of irregular / total students) * 100
count_irreg = np.sum(df6["Status"] == "Irregular")
find_perc_stud = (count_irreg / len(df6)) * 100
# print(count_irreg)
print(find_perc_stud.round(2))
print("_"*50)

# 29. Find the top 3 students by Average_Marks
#     Hint: sort_values() + head(3)
#     df.sort_values("column", ascending=False).head(3)
find_top_3 = df6.sort_values("Average_Marks" , ascending=False).head(3)
print(find_top_3)
print("_"*50)

# 30. Find which Section has better average performance
#     (higher average of Average_Marks)
avg_per = df6.groupby("Section")["Average_Marks"].mean()
high_avg = avg_per.idxmax()
print(f"The {high_avg} has the best average performance")

# Small Practice - chatGPT mini tasks

In [ ]:
import pandas as pd
import numpy as np

data7 = {
    "Name": ["A", "B", "C", "D", "E"],
    "Age": [25, np.nan, 22, 30, 26],
    "Salary": [30000, 40000, np.nan, 50000, 35000],
    "Department": ["HR", "IT", "Finance", np.nan, "HR"]
}

df7 = pd.DataFrame(data7)
print(df7)
print("_"*45)
# 1 Count missing values in each column
print(df7.isnull().sum())

# 2 Fill Age with mean
fill_age = df7["Age"].mean()
df7["Age"] = df7["Age"].fillna(fill_age)

# 3 Fill Salary with median
fill_sal = df7["Salary"].median()
df7["Salary"] = df7["Salary"].fillna(fill_sal)

# 4 Fill Department with "Unknown"
df7["Department"] = df7["Department"].fillna("Unknown")

# 5 Rename "Salary" to "Monthly_Salary"
df7.rename(columns={"Salary":"Montly_Salary"}, inplace = True)

# 6 Convert Age to integer
df7["Age"] = df7["Age"].astype(int)
print(df7)

In [ ]:
import pandas as pd
import numpy as np

data8 = {
    "Name": [" A ", "B", "C", "D", "B"],
    "Age": ["25", "28", "22", "30", "28"],
    "Salary": ["30,000", "40,000", "25,000", "50,000", "40,000"],
    "Department": ["hr", "IT", "Finance", "it", "IT"]
}

df8 = pd.DataFrame(data8)

df8.shape

# RemoveDuplicates
df8 = df8.drop_duplicates()
print(df8,"\n")

df8["Name"] = df8["Name"].str.strip()
print(df8,"\n")

df8["Department"] = df8["Department"].str.upper()
print(df8,"\n")

df8["Salary"] = df8["Salary"].str.replace(",", "")
df8["Salary"] = df8["Salary"].astype(int)
print(df8,"\n")

df8["Age"] = df8["Age"].astype(int)
print(df8,"\n")

df8["Salary_Level"] = df8["Salary"].apply(
    lambda x: "High" if x > 35000 else "Low"
)

df8["Tax"] = df8["Salary"] * 0.10
print(df8,"\n")

In [ ]:
import pandas as pd

data = {
    "Employee": ["A", "B", "C", "D", "E", "F", "G", "H"],
    "Department": ["IT", "HR", "IT", "Finance", "HR", "IT", "Finance", "HR"],
    "Salary": [50000, 40000, 60000, 70000, 45000, 55000, 65000, 42000],
    "Experience": [2, 3, 5, 6, 4, 3, 7, 2]
}

df = pd.DataFrame(data)
print(df)
print("_" * 50)

# Find the average salary of each department.
avg_sal = df.groupby("Department")["Salary"].mean().round(2)
print("average salary of each department:-",avg_sal)
print("_" * 50)

# Find the total salary paid by each department.
total_sal = df.groupby("Department")["Salary"].sum()
print("Total salary of each department:-",total_sal)
print("_" * 50)
# Count how many employees are in each department.
count_emps = df["Department"].value_counts()
print(count_emps)
print("_" * 50)

# Find minimum and maximum salary in each department (in one output table).
sort_min_max = df.groupby("Department")["Salary"].agg([ "min" , "max"]).round(2)
print(sort_min_max)
print("_" * 50)

# Sort departments based on average salary (highest to lowest).
sort_avg_sal = df.groupby("Department")["Salary"].mean().sort_values().round(2).reset_index()   #We can use the chained operations like this 
print(sort_avg_sal)
print("_" * 50)

# Find the average experience of each department.
avg_exp = df.groupby("Department")["Experience"].mean().astype(int)
print(avg_exp)
print("_" * 50)

# Find department with:
# Highest total salary
# Most employees
#   (Hint: Use .sort_values() or .idxmax())
find_high_sal = total_sal.sort_values().idxmax()
print(find_high_sal)
print("_" * 50)

dep_emp_count = df.groupby("Department")["Employee"].count().idxmax()
print(dep_emp_count)


# Create a table that shows:
# Department
# Average Salary
# Average Experience
table = df.groupby("Department").agg({"Salary":"mean" , "Experience":"mean"}).round(2).reset_index()
print(table)

# Using Lambda function Tasks in PANDAS

In [1]:
import pandas as pd
import numpy as np

data1 = {
    "Order_ID":   [301, 302, 303, 304, 305, 306, 307, 308, 309, 310],
    "Customer":   ["  ravi kumar  ", "PRIYA", "arjun", "SNEHA REDDY",
                   "kumar", "  DIVYA  ", "kiran", "MEENA", "suresh", "anita"],
    "Category":   ["Electronics", "Clothing", "Electronics", "Furniture",
                   "Clothing", "Electronics", "Furniture", "Clothing",
                   "Electronics", "Furniture"],
    "Amount":     [15000, 2500, 45000, 12000, 1800, 30000, 8000, 3500, 22000, 18000],
    "Quantity":   [1, 3, 2, 1, 4, 1, 2, 5, 1, 2],
    "Experience": [2, 5, 8, 1, 3, 12, 6, 4, 9, 7],
    "City":       ["hyderabad", "CHENNAI", "mumbai", "DELHI",
                   "hyderabad", "chennai", "MUMBAI", "delhi",
                   "HYDERABAD", "mumbai"]
}

# Tasks:
# 1.  Create the DataFrame
df1 = pd.DataFrame(data1)
print(df1)

# 2.  Clean Customer names  strip spaces and convert to title case
df1["Customer"] = df1["Customer"].str.strip()
df1["Customer"] = df1["Customer"].str.title()

# 3.  Clean City  convert all to title case (consistent format)
df1["City"] = df1["City"].str.title()
df1

# 4.  Add "Revenue" column = Amount * Quantity
df1["Revenue"] = df1["Amount"] * df1["Quantity"]
df1
print("_" * 80)

# 5.  Add "Discount" column using apply() + lambda:
#     Amount > 20000  15% discount (Amount * 0.15)
#     Amount > 10000  10% discount (Amount * 0.10)
#     Otherwise       5% discount  (Amount * 0.05)
df1["Discount"] = df1["Amount"].apply(lambda x: x * 0.15 if x>20000 else(x *0.10 if x >10000 else x *0.05))
df1

# 6.  Add "Final_Amount" column = Amount - Discount (round to 2)
df1["Final_Amount"] = df1.apply(lambda x: x["Amount"] - x["Discount"] , axis =1).round(2)   #using two column operations in lambda
df1

# 7.  Add "Customer_Type" column using apply():
#     Experience > 8   "Premium"
#     Experience > 4   "Regular"
#     Otherwise        "New"
df1["Customer_Type"] = df1["Experience"].apply(lambda x: "Premium" if x >8 else("Regular" if x>4 else "New"))
df1

# 8.  Check distribution of Category using value_counts()
dist_cate = df1["Category"].value_counts()
print(dist_cate)
print("_" * 80)

# 9.  Check distribution of Customer_Type using value_counts()
dist_cstr = df1["Customer_Type"].value_counts()
print(dist_cstr)
print("_" * 80)

# 10. Sort by Revenue descending  show top 5 orders
sort_rev = df1.sort_values("Revenue",ascending=False).reset_index()
print(sort_rev.head(5)) 
print("_" * 80)

# 11. Find average Revenue per Category using groupby
avg_rev = df1.groupby("Category")["Revenue"].mean().round(2)
print(avg_rev)
print("_" * 80)

# 12. Find total Revenue per City using groupby
total_rev = df1.groupby("City")["Revenue"].sum()
print(total_rev)
print("_" * 80)

# 13. Filter only Electronics orders with Amount above 20000
filter_ele = df1.loc[(df1["Amount"] >20000) & (df1["Category"] == "Electronics") ]
print(filter_ele)
print("_" * 80)

# 14. Find the Customer with highest Final_Amount
#     Hint: idxmax() + loc
high_final_cust = df1.loc[df1["Final_Amount"].idxmax(), ["Customer"]]
print(high_final_cust)
print("_" * 80)
# 15. Find what percentage of customers are "Premium"
count_cust = np.sum(df1["Customer_Type"] == "Premium")
calculate_per =  (count_cust / len(df1)) * 100
print("Percentage of customers are Premium:-",calculate_per)
print("_" * 80)

   Order_ID        Customer     Category  Amount  Quantity  Experience  \
0       301    ravi kumar    Electronics   15000         1           2
1       302           PRIYA     Clothing    2500         3           5
2       303           arjun  Electronics   45000         2           8
3       304     SNEHA REDDY    Furniture   12000         1           1
4       305           kumar     Clothing    1800         4           3
5       306         DIVYA    Electronics   30000         1          12
6       307           kiran    Furniture    8000         2           6
7       308           MEENA     Clothing    3500         5           4
8       309          suresh  Electronics   22000         1           9
9       310           anita    Furniture   18000         2           7

        City
0  hyderabad
1    CHENNAI
2     mumbai
3      DELHI
4  hyderabad
5    chennai
6     MUMBAI
7      delhi
8  HYDERABAD
9     mumbai
________________________________________________________________________________
Category
Electronics    4
Clothing       3
Furniture      3
Name: count, dtype: int64
________________________________________________________________________________
Customer_Type
New        4
Regular    4
Premium    2
Name: count, dtype: int64
________________________________________________________________________________
   index  Order_ID Customer     Category  Amount  Quantity  Experience  \
0      2       303    Arjun  Electronics   45000         2           8
1      9       310    Anita    Furniture   18000         2           7
2      5       306    Divya  Electronics   30000         1          12
3      8       309   Suresh  Electronics   22000         1           9
4      7       308    Meena     Clothing    3500         5           4

        City  Revenue  Discount  Final_Amount Customer_Type
0     Mumbai    90000    6750.0       38250.0       Regular
1     Mumbai    36000    1800.0       16200.0       Regular
2    Chennai    30000    4500.0       25500.0       Premium
3  Hyderabad    22000    3300.0       18700.0       Premium
4      Delhi    17500     175.0        3325.0           New
________________________________________________________________________________
Category
Clothing       10733.33
Electronics    39250.00
Furniture      21333.33
Name: Revenue, dtype: float64
________________________________________________________________________________
City
Chennai       37500
Delhi         29500
Hyderabad     44200
Mumbai       142000
Name: Revenue, dtype: int64
________________________________________________________________________________
   Order_ID Customer     Category  Amount  Quantity  Experience       City  \
2       303    Arjun  Electronics   45000         2           8     Mumbai
5       306    Divya  Electronics   30000         1          12    Chennai
8       309   Suresh  Electronics   22000         1           9  Hyderabad

   Revenue  Discount  Final_Amount Customer_Type
2    90000    6750.0       38250.0       Regular
5    30000    4500.0       25500.0       Premium
8    22000    3300.0       18700.0       Premium
________________________________________________________________________________
Customer    Arjun
Name: 2, dtype: object
________________________________________________________________________________
Percentage of customers are Premium:- 20.0
________________________________________________________________________________

# TITANIC - DATASET CSV for Real World Problem - Practice - PANDAS (IMP)

In [ ]:
import pandas as pd
import numpy as np

url = "https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv"
df = pd.read_csv(url)

# 1. Load and print first 5 rows  understand what the data is about
print(df.head(5))
print("_" * 80)
print(df.tail(5))
df.head()

# 2. Check shape  how many passengers, how many columns
print(df.shape)
print("_" * 80)

# 3. Run .info()  check data types
df.info()
print("_" * 80)

# 4. Run .describe()  look at the numbers carefully
print(df.describe())
print("_" * 80)

# 5. Find missing values  which columns and what percentage
print(df.isnull().sum())
print((df.isnull().sum()/len(df)) * 100)
print("_" * 80)

# 6. Check duplicates

print(df.duplicated().sum())
print(df.drop_duplicates())
print("_" * 80)

# 7. Find unique values in categorical columns 
#    (Sex, Embarked, Pclass)
print(df["Sex"].unique())
print(df["Embarked"].unique())
print(df["Pclass"].unique())
print("_" * 80)

# 8. Check outliers in Age and Fare columns using IQR
print("mean:-", df["Age"].mean())
print("median:-", df["Fare"].median())

Q1 = df["Age"].quantile(0.25)
Q3 = df["Fare"].quantile(0.75)

IQR = Q3 - Q1

lower = Q1 - 1.5 * IQR
upper = Q3 - 1.5 * IQR

outliers = df[(df["Age"] < lower) | (df["Fare"] > upper)]
print(f"Number of outliers: {len(outliers)}")
print(outliers)
print("_" * 80)


# 9. Find correlation  which columns relate most to "Survived"
print(df.corr(numeric_only=True))
print(df.corr(numeric_only=True)["Survived"])


# 10. Answer these questions using your Pandas skills:
#     a) How many passengers survived vs didn't survive?
#        (value_counts on Survived column)
#     b) What was the survival rate? (percentage)
#     c) What was the average age of passengers?
#     d) How many males vs females were on the ship?
#     e) Which passenger class (Pclass) had most passengers?
#     f) Find average Fare per Pclass using groupby
#     g) Find survival count per Sex using groupby
#     h) Find the oldest and youngest passenger on the ship

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S
________________________________________________________________________________
     PassengerId  Survived  Pclass                                      Name  \
886          887         0       2                     Montvila, Rev. Juozas
887          888         1       1              Graham, Miss. Margaret Edith
888          889         0       3  Johnston, Miss. Catherine Helen "Carrie"
889          890         1       1                     Behr, Mr. Karl Howell
890          891         0       3                       Dooley, Mr. Patrick

        Sex   Age  SibSp  Parch      Ticket   Fare Cabin Embarked
886    male  27.0      0      0      211536  13.00   NaN        S
887  female  19.0      0      0      112053  30.00   B42        S
888  female   NaN      1      2  W./C. 6607  23.45   NaN        S
889    male  26.0      0      0      111369  30.00  C148        C
890    male  32.0      0      0      370376   7.75   NaN        Q
(891, 12)
________________________________________________________________________________
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB
________________________________________________________________________________
       PassengerId    Survived      Pclass         Age       SibSp  \
count   891.000000  891.000000  891.000000  714.000000  891.000000
mean    446.000000    0.383838    2.308642   29.699118    0.523008
std     257.353842    0.486592    0.836071   14.526497    1.102743
min       1.000000    0.000000    1.000000    0.420000    0.000000
25%     223.500000    0.000000    2.000000   20.125000    0.000000
50%     446.000000    0.000000    3.000000   28.000000    0.000000
75%     668.500000    1.000000    3.000000   38.000000    1.000000
max     891.000000    1.000000    3.000000   80.000000    8.000000

            Parch        Fare
count  891.000000  891.000000
mean     0.381594   32.204208
std      0.806057   49.693429
min      0.000000    0.000000
25%      0.000000    7.910400
50%      0.000000   14.454200
75%      0.000000   31.000000
max      6.000000  512.329200
________________________________________________________________________________
PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64
PassengerId     0.000000
Survived        0.000000
Pclass          0.000000
Name            0.000000
Sex             0.000000
Age            19.865320
SibSp           0.000000
Parch           0.000000
Ticket          0.000000
Fare            0.000000
Cabin          77.104377
Embarked        0.224467
dtype: float64
________________________________________________________________________________
0
     PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
..     ...               ...      ...   ...      ...
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S
889      0            111369  30.0000  C148        C
890      0            370376   7.7500   NaN        Q

[891 rows x 12 columns]
________________________________________________________________________________
['male' 'female']
['S' 'C' 'Q' nan]
[3 1 2]
________________________________________________________________________________
mean:- 29.69911764705882
median:- 14.4542
Number of outliers: 439
     PassengerId  Survived  Pclass  \
1              2         1       1
3              4         1       1
6              7         0       1
7              8         0       3
9             10         1       2
..           ...       ...     ...
880          881         1       2
885          886         0       3
887          888         1       1
888          889         0       3
889          890         1       1

                                                  Name     Sex   Age  SibSp  \
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
6                              McCarthy, Mr. Timothy J    male  54.0      0
7                       Palsson, Master. Gosta Leonard    male   2.0      3
9                  Nasser, Mrs. Nicholas (Adele Achem)  female  14.0      1
..                                                 ...     ...   ...    ...
880       Shelley, Mrs. William (Imanita Parrish Hall)  female  25.0      0
885               Rice, Mrs. William (Margaret Norton)  female  39.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0

     Parch      Ticket     Fare Cabin Embarked
1        0    PC 17599  71.2833   C85        C
3        0      113803  53.1000  C123        S
6        0       17463  51.8625   E46        S
7        1      349909  21.0750   NaN        S
9        0      237736  30.0708   NaN        C
..     ...         ...      ...   ...      ...
880      1      230433  26.0000   NaN        S
885      5      382652  29.1250   NaN        Q
887      0      112053  30.0000   B42        S
888      2  W./C. 6607  23.4500   NaN        S
889      0      111369  30.0000  C148        C

[439 rows x 12 columns]
________________________________________________________________________________
             PassengerId  Survived    Pclass       Age     SibSp     Parch  \
PassengerId     1.000000 -0.005007 -0.035144  0.036847 -0.057527 -0.001652
Survived       -0.005007  1.000000 -0.338481 -0.077221 -0.035322  0.081629
Pclass         -0.035144 -0.338481  1.000000 -0.369226  0.083081  0.018443
Age             0.036847 -0.077221 -0.369226  1.000000 -0.308247 -0.189119
SibSp          -0.057527 -0.035322  0.083081 -0.308247  1.000000  0.414838
Parch          -0.001652  0.081629  0.018443 -0.189119  0.414838  1.000000
Fare            0.012658  0.257307 -0.549500  0.096067  0.159651  0.216225

                 Fare
PassengerId  0.012658
Survived     0.257307
Pclass      -0.549500
Age          0.096067
SibSp        0.159651
Parch        0.216225
Fare         1.000000
PassengerId   -0.005007
Survived       1.000000
Pclass        -0.338481
Age           -0.077221
SibSp         -0.035322
Parch          0.081629
Fare           0.257307
Name: Survived, dtype: float64